Revit 2027 API
ElectricalSystem.HotConductorSize Property
 The size of a Hot Conductor in the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HotConductorSize { get; }
Public ReadOnly Property HotConductorSize As ElementId
	Get
public:
property ElementId^ HotConductorSize {
	ElementId^ get ();
}
member HotConductorSize : ElementId with get
Property Value
ElementId
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 Each Hot Conductor has the same size in the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace